ahtn/keyplus/efm8/efm8/mcu/C8051F360/inc/SI_C8051F360_Defs.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F360_GQ
//  C8051F361_GQ
//  C8051F362_GM
//  C8051F363_GQ
//  C8051F364_GQ
//  C8051F365_GM
//  C8051F366_GQ
//  C8051F367_GM
//  C8051F368_GQ
//  C8051F369_GM

#ifndef SI_C8051F360_DEFS_H
#define SI_C8051F360_DEFS_H

#include <compiler_defs.h>

//-----------------------------------------------------------------------------
// Register Definitions
//-----------------------------------------------------------------------------
SFR (ACC,      0xE0); ///< Accumulator                              
SFR (ADC0CF,   0xBC); ///< ADC0 Configuration                       
SFR (ADC0CN,   0xE8); ///< ADC0 Control                             
SFR (ADC0GTH,  0xC4); ///< ADC0 Greater-Than High Byte              
SFR (ADC0GTL,  0xC3); ///< ADC0 Greater-Than Low Byte               
SFR (ADC0H,    0xBE); ///< ADC0 Data Word High Byte                 
SFR (ADC0L,    0xBD); ///< ADC0 Data Word Low Byte                  
SFR (ADC0LTH,  0xC6); ///< ADC0 Less-Than High Byte                 
SFR (ADC0LTL,  0xC5); ///< ADC0 Less-Than Low Byte                  
SFR (AMX0N,    0xBA); ///< AMUX0 Negative Multiplexer Selection     
SFR (AMX0P,    0xBB); ///< AMUX0 Positive Multiplexer Selection     
SFR (B,        0xF0); ///< B Register                               
SFR (CCH0CN,   0x84); ///< Cache Control                            
SFR (CCH0LC,   0xD2); ///< Cache Lock Control                       
SFR (CCH0MA,   0xD3); ///< Cache Miss Accumulator                   
SFR (CCH0TN,   0xC9); ///< Cache Tuning                             
SFR (CKCON,    0x8E); ///< Clock Control                            
SFR (CLKSEL,   0x8F); ///< Clock Select                             
SFR (CPT0CN,   0x9B); ///< Comparator 0 Control                     
SFR (CPT0MD,   0x9D); ///< Comparator 0 Mode                        
SFR (CPT0MX,   0x9F); ///< Comparator 0 Multiplexer Selection       
SFR (CPT1CN,   0x9A); ///< Comparator 1 Control                     
SFR (CPT1MD,   0x9C); ///< Comparator 1 Mode                        
SFR (CPT1MX,   0x9E); ///< Comparator 1 Multiplexer Selection       
SFR (DPH,      0x83); ///< Data Pointer High                        
SFR (DPL,      0x82); ///< Data Pointer Low                         
SFR (EIE1,     0xE6); ///< Extended Interrupt Enable 1              
SFR (EIE2,     0xE7); ///< Extended Interrupt Enable 2              
SFR (EIP1,     0xCE); ///< Extended Interrupt Priority 1            
SFR (EIP2,     0xCF); ///< Extended Interrupt Priority 2            
SFR (EMI0CF,   0xC7); ///< External Memory Configuration            
SFR (EMI0CN,   0xAA); ///< External Memory Interface Control        
SFR (EMI0TC,   0xF7); ///< External Memory Timing Control           
SFR (FLKEY,    0xB7); ///< Flash Lock and Key                       
SFR (FLSCL,    0xB6); ///< Flash Scale                              
SFR (FLSTAT,   0xAC); ///< Flash Status                             
SFR (IDA0CN,   0xB9); ///< IDAC0 Control                            
SFR (IDA0H,    0x97); ///< IDAC0 Data High Byte                     
SFR (IDA0L,    0x96); ///< IDAC0 Data Low Byte                      
SFR (IE,       0xA8); ///< Interrupt Enable                         
SFR (IP,       0xB8); ///< Interrupt Priority                       
SFR (IT01CF,   0xE4); ///< INT0/INT1 Configuration                  
SFR (MAC0ACC0, 0xD2); ///< Accumulator Byte 0                       
SFR (MAC0ACC1, 0xD3); ///< Accumulator Byte 1                       
SFR (MAC0ACC2, 0xD4); ///< Accumulator Byte 2                       
SFR (MAC0ACC3, 0xD5); ///< Accumulator Byte 3                       
SFR (MAC0AH,   0xA5); ///< Operand A High Byte                      
SFR (MAC0AL,   0xA4); ///< Operand A Low Byte                       
SFR (MAC0BH,   0xF2); ///< Operand B High Byte                      
SFR (MAC0BL,   0xF1); ///< Operand B Low Byte                       
SFR (MAC0CF,   0xD7); ///< MAC0 Configuration                       
SFR (MAC0OVR,  0xD6); ///< Accumulator Overflow Byte                
SFR (MAC0RNDH, 0xAF); ///< Rounded Result High Byte                 
SFR (MAC0RNDL, 0xAE); ///< Rounded Result Low Byte                  
SFR (MAC0STA,  0xCF); ///< MAC0 Status                              
SFR (OSCICL,   0xBF); ///< High Frequency Oscillator Calibration    
SFR (OSCICN,   0xB7); ///< High Frequency Oscillator Control        
SFR (OSCLCN,   0xAD); ///< Internal Low Frequency Oscillator Control
SFR (OSCXCN,   0xB6); ///< External Oscillator Control              
SFR (P0,       0x80); ///< Port 0 Pin Latch                         
SFR (P0MASK,   0xF4); ///< Port 0 Mask                              
SFR (P0MAT,    0xF3); ///< Port 0 Match                             
SFR (P0MDIN,   0xF1); ///< Port 0 Input Mode                        
SFR (P0MDOUT,  0xA4); ///< Port 0 Output Mode                       
SFR (P0SKIP,   0xD4); ///< Port 0 Skip                              
SFR (P1,       0x90); ///< Port 1 Pin Latch                         
SFR (P1MASK,   0xE2); ///< Port 1 Mask                              
SFR (P1MAT,    0xE1); ///< Port 1 Match                             
SFR (P1MDIN,   0xF2); ///< Port 1 Input Mode                        
SFR (P1MDOUT,  0xA5); ///< Port 1 Output Mode                       
SFR (P1SKIP,   0xD5); ///< Port 1 Skip                              
SFR (P2,       0xA0); ///< Port 2 Pin Latch                         
SFR (P2MASK,   0xB2); ///< Port 2 Mask                              
SFR (P2MAT,    0xB1); ///< Port 2 Match                             
SFR (P2MDIN,   0xF3); ///< Port 2 Input Mode                        
SFR (P2MDOUT,  0xA6); ///< Port 2 Output Mode                       
SFR (P2SKIP,   0xD6); ///< Port 2 Skip                              
SFR (P3,       0xB0); ///< Port 3 Pin Latch                         
SFR (P3MDIN,   0xF4); ///< Port 3 Input Mode                        
SFR (P3MDOUT,  0xAF); ///< Port 3 Output Mode                       
SFR (P3SKIP,   0xD7); ///< Port 3 Skip                              
SFR (P4,       0xB5); ///< Port 4 Pin Latch                         
SFR (P4MDOUT,  0xAE); ///< Port 4 Output Mode                       
SFR (PCA0CN,   0xD8); ///< PCA Control                              
SFR (PCA0CPH0, 0xFC); ///< PCA Channel 0 Capture Module High Byte   
SFR (PCA0CPH1, 0xEA); ///< PCA Channel 1 Capture Module High Byte   
SFR (PCA0CPH2, 0xEC); ///< PCA Channel 2 Capture Module High Byte   
SFR (PCA0CPH3, 0xEE); ///< PCA Channel 3 Capture Module High Byte   
SFR (PCA0CPH4, 0xFE); ///< PCA Channel 4 Capture Module High Byte   
SFR (PCA0CPH5, 0xF6); ///< PCA Channel 5 Capture Module High Byte   
SFR (PCA0CPL0, 0xFB); ///< PCA Channel 0 Capture Module Low Byte    
SFR (PCA0CPL1, 0xE9); ///< PCA Channel 1 Capture Module Low Byte    
SFR (PCA0CPL2, 0xEB); ///< PCA Channel 2 Capture Module Low Byte    
SFR (PCA0CPL3, 0xED); ///< PCA Channel 3 Capture Module Low Byte    
SFR (PCA0CPL4, 0xFD); ///< PCA Channel 4 Capture Module Low Byte    
SFR (PCA0CPL5, 0xF5); ///< PCA Channel 5 Capture Module Low Byte    
SFR (PCA0CPM0, 0xDA); ///< PCA Channel 0 Capture/Compare Mode 0     
SFR (PCA0CPM1, 0xDB); ///< PCA Channel 1 Capture/Compare Mode       
SFR (PCA0CPM2, 0xDC); ///< PCA Channel 2 Capture/Compare Mode       
SFR (PCA0CPM3, 0xDD); ///< PCA Channel 3 Capture/Compare Mode       
SFR (PCA0CPM4, 0xDE); ///< PCA Channel 4 Capture/Compare Mode       
SFR (PCA0CPM5, 0xDF); ///< PCA Channel 5 Capture/Compare Mode       
SFR (PCA0H,    0xFA); ///< PCA Counter/Timer High Byte              
SFR (PCA0L,    0xF9); ///< PCA Counter/Timer Low Byte               
SFR (PCA0MD,   0xD9); ///< PCA Mode                                 
SFR (PCON,     0x87); ///< Power Control                            
SFR (PLL0CN,   0xB3); ///< PLL Control                              
SFR (PLL0DIV,  0xA9); ///< PLL Divider                              
SFR (PLL0FLT,  0xB2); ///< PLL Filter                               
SFR (PLL0MUL,  0xB1); ///< PLL Multiplier                           
SFR (PSCTL,    0x8F); ///< Program Store Control                    
SFR (PSW,      0xD0); ///< Program Status Word                      
SFR (REF0CN,   0xD1); ///< Voltage Reference Control                
SFR (RSTSRC,   0xEF); ///< Reset Source                             
SFR (SBUF0,    0x99); ///< UART0 Serial Port Data Buffer            
SFR (SCON0,    0x98); ///< UART0 Serial Port Control                
SFR (SFR0CN,   0xE5); ///< SFR Page Control                         
SFR (SFRLAST,  0x86); ///< SFR Page Last                            
SFR (SFRNEXT,  0x85); ///< SFR Page Next                            
SFR (SFRPAGE,  0xA7); ///< SFR Page                                 
SFR (SMB0CF,   0xC1); ///< SMBus 0 Configuration                    
SFR (SMB0CN,   0xC0); ///< SMBus 0 Control                          
SFR (SMB0DAT,  0xC2); ///< SMBus 0 Data                             
SFR (SP,       0x81); ///< Stack Pointer                            
SFR (SPI0CFG,  0xA1); ///< SPI0 Configuration                       
SFR (SPI0CKR,  0xA2); ///< SPI0 Clock Rate                          
SFR (SPI0CN,   0xF8); ///< SPI0 Control                             
SFR (SPI0DAT,  0xA3); ///< SPI0 Data                                
SFR (TCON,     0x88); ///< Timer 0/1 Control                        
SFR (TH0,      0x8C); ///< Timer 0 High Byte                        
SFR (TH1,      0x8D); ///< Timer 1 High Byte                        
SFR (TL0,      0x8A); ///< Timer 0 Low Byte                         
SFR (TL1,      0x8B); ///< Timer 1 Low Byte                         
SFR (TMOD,     0x89); ///< Timer 0/1 Mode                           
SFR (TMR2CN,   0xC8); ///< Timer 2 Control                          
SFR (TMR2H,    0xCD); ///< Timer 2 High Byte                        
SFR (TMR2L,    0xCC); ///< Timer 2 Low Byte                         
SFR (TMR2RLH,  0xCB); ///< Timer 2 Reload High Byte                 
SFR (TMR2RLL,  0xCA); ///< Timer 2 Reload Low Byte                  
SFR (TMR3CN,   0x91); ///< Timer 3 Control                          
SFR (TMR3H,    0x95); ///< Timer 3 High Byte                        
SFR (TMR3L,    0x94); ///< Timer 3 Low Byte                         
SFR (TMR3RLH,  0x93); ///< Timer 3 Reload High Byte                 
SFR (TMR3RLL,  0x92); ///< Timer 3 Reload Low Byte                  
SFR (VDM0CN,   0xFF); ///< VDD Supply Monitor Control               
SFR (XBR0,     0xE1); ///< Port I/O Crossbar 0                      
SFR (XBR1,     0xE2); ///< Port I/O Crossbar 1                      

//------------------------------------------------------------------------------
// 16-bit Register Definitions (may not work on all compilers)
//------------------------------------------------------------------------------
SFR16 (ADC0GT,  0xC3); ///< ADC0 Greater-Than            
SFR16 (ADC0,    0xBD); ///< ADC0 Data Word               
SFR16 (ADC0LT,  0xC5); ///< ADC0 Less-Than               
SFR16 (DP,      0x82); ///< Data Pointer                 
SFR16 (MAC0A,   0xA4); ///< Operand A                    
SFR16 (MAC0B,   0xF1); ///< Operand B                    
SFR16 (MAC0RND, 0xAE); ///< Rounded Result               
SFR16 (PCA0CP0, 0xFB); ///< PCA Channel 0 Capture Module 
SFR16 (PCA0CP1, 0xE9); ///< PCA Channel 1 Capture Module 
SFR16 (PCA0CP2, 0xEB); ///< PCA Channel 2 Capture Module 
SFR16 (PCA0CP3, 0xED); ///< PCA Channel 3 Capture Module 
SFR16 (PCA0CP4, 0xFD); ///< PCA Channel 4 Capture Module 
SFR16 (PCA0CP5, 0xF5); ///< PCA Channel 5 Capture Module 
SFR16 (PCA0,    0xF9); ///< PCA Counter/Timer            
SFR16 (TMR2,    0xCC); ///< Timer 2                      
SFR16 (TMR2RL,  0xCA); ///< Timer 2 Reload               
SFR16 (TMR3,    0x94); ///< Timer 3                      
SFR16 (TMR3RL,  0x92); ///< Timer 3 Reload               

//------------------------------------------------------------------------------
// Indirect Register Definitions
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC (Accumulator)
#define SFR_ACC 0xE0
SBIT (ACC_ACC0, SFR_ACC, 0); ///< Accumulator Bit 0
SBIT (ACC_ACC1, SFR_ACC, 1); ///< Accumulator Bit 1
SBIT (ACC_ACC2, SFR_ACC, 2); ///< Accumulator Bit 2
SBIT (ACC_ACC3, SFR_ACC, 3); ///< Accumulator Bit 3
SBIT (ACC_ACC4, SFR_ACC, 4); ///< Accumulator Bit 4
SBIT (ACC_ACC5, SFR_ACC, 5); ///< Accumulator Bit 5
SBIT (ACC_ACC6, SFR_ACC, 6); ///< Accumulator Bit 6
SBIT (ACC_ACC7, SFR_ACC, 7); ///< Accumulator Bit 7

// ADC0CN (ADC0 Control)
#define SFR_ADC0CN 0xE8
SBIT (ADC0CN_ADCM0,  SFR_ADC0CN, 0); ///< Start of Conversion Mode Select Bit 0
SBIT (ADC0CN_ADCM1,  SFR_ADC0CN, 1); ///< Start of Conversion Mode Select Bit 1
SBIT (ADC0CN_ADCM2,  SFR_ADC0CN, 2); ///< Start of Conversion Mode Select Bit 2
SBIT (ADC0CN_ADWINT, SFR_ADC0CN, 3); ///< Window Compare Interrupt Flag        
SBIT (ADC0CN_ADBUSY, SFR_ADC0CN, 4); ///< ADC Busy                             
SBIT (ADC0CN_ADINT,  SFR_ADC0CN, 5); ///< Conversion Complete Interrupt Flag   
SBIT (ADC0CN_ADTM,   SFR_ADC0CN, 6); ///< Track Mode                           
SBIT (ADC0CN_ADEN,   SFR_ADC0CN, 7); ///< ADC Enable                           

// B (B Register)
#define SFR_B 0xF0
SBIT (B_B0, SFR_B, 0); ///< B Register Bit 0
SBIT (B_B1, SFR_B, 1); ///< B Register Bit 1
SBIT (B_B2, SFR_B, 2); ///< B Register Bit 2
SBIT (B_B3, SFR_B, 3); ///< B Register Bit 3
SBIT (B_B4, SFR_B, 4); ///< B Register Bit 4
SBIT (B_B5, SFR_B, 5); ///< B Register Bit 5
SBIT (B_B6, SFR_B, 6); ///< B Register Bit 6
SBIT (B_B7, SFR_B, 7); ///< B Register Bit 7

// IE (Interrupt Enable)
#define SFR_IE 0xA8
SBIT (IE_EX0,   SFR_IE, 0); ///< External Interrupt 0 Enable
SBIT (IE_ET0,   SFR_IE, 1); ///< Timer 0 Interrupt Enable   
SBIT (IE_EX1,   SFR_IE, 2); ///< External Interrupt 1 Enable
SBIT (IE_ET1,   SFR_IE, 3); ///< Timer 1 Interrupt Enable   
SBIT (IE_ES0,   SFR_IE, 4); ///< UART0 Interrupt Enable     
SBIT (IE_ET2,   SFR_IE, 5); ///< Timer 2 Interrupt Enable   
SBIT (IE_ESPI0, SFR_IE, 6); ///< SPI0 Interrupt Enable      
SBIT (IE_EA,    SFR_IE, 7); ///< All Interrupts Enable      

